# Machine Learning Review Exercise 3 (ML_SP22_RE_3) on EDA

### Due Date: 3/7/2022 23:59 pm

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

***The goal of this review excercise is to practice Explorary Data Analysis similar to what we had shown in class***

***in particular***

* Check if there are any missing values
* Handle missing values by dropping the rows or fill in missing values by imputation
* Check for outliers and remove them (if needed)
* Compute simple statistics on single variables
* Basic Plots (pairplots, boxplots etc)
* Investigate Categorial Variables
* Facet Grid
* Build simple linear regression model

In [2]:
df = pd.read_csv("Salaries2.csv")
df.head()

       Rank Discipline  YrsSincePhd  YrsOfService   Sex  Salary
0      Prof          B         19.0          18.0  Male  139750
1      Prof          B         20.0          16.0  Male  173200
2  AsstProf          B          4.0           3.0  Male   79750
3      Prof          B         45.0          39.0  Male  115000
4      Prof          B         40.0          41.0  Male  141500

In [3]:
df.tail()

         Rank Discipline  YrsSincePhd  YrsOfService   Sex  Salary
398      Prof          A         33.0          30.0  Male  103106
399      Prof          A         31.0          19.0  Male  150564
400      Prof          A         42.0          25.0  Male  101738
401      Prof          A         25.0          15.0  Male   95329
402  AsstProf          A          8.0           4.0  Male   81035

In [4]:
df.describe()

       YrsSincePhd  YrsOfService        Salary
count   402.000000    402.000000  4.030000e+02
mean     22.258706     17.684080  1.160301e+05
std      12.870455     13.571541  5.398971e+04
min       1.000000      0.000000  5.780000e+04
25%      12.000000      7.000000  9.116350e+04
50%      21.000000     16.000000  1.073090e+05
75%      32.000000     26.000000  1.343675e+05
max      56.000000    101.000000  1.012100e+06

In [5]:
df.shape

(400, 9)

### Check Missing Data

In [ ]:
Type your code here

### Remove missing data rows

In [ ]:
Type your code here

### check and remove outliers

Type your code here

### Simple plots using Seaborn

Type your code here

### calculate Correlation, find out which variables have the highest correlation with Salary

Type your code here

### Now focus on the relationship between that variable and Salary. Do a scatter if needed

In [5]:
#sns.scatterplot(x='...', y = '...', data = df)

### Fit a linear Regression model

In [6]:
# Extract a numpy array from the dataframe
#X = df['...'].values
#Y = df['...''].values
#sns.scatterplot(x=X, y=Y)

In [7]:
# create a model
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [37]:
# Need a 2D numpy array, so call reshape(-1, 1)
#X = df['...'].values.reshape(-1,1)
#Y = df['...'].values.reshape(-1,1)

In [38]:
# Fit the model
#model.fit(X, Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [39]:
# now make the prediction
#Y_pred = model.predict(X)

In [10]:
#plt.scatter(X, Y,  color='gray')
#plt.plot(X, Y_pred, color='red', linewidth=2)
#plt.show()

In [11]:
#print(model.intercept_)
#print(model.coef_)

## Now investigate how the categorical variables affect the Salary

In [8]:
df.head()

       Rank Discipline  YrsSincePhd  YrsOfService   Sex  Salary
0      Prof          B         19.0          18.0  Male  139750
1      Prof          B         20.0          16.0  Male  173200
2  AsstProf          B          4.0           3.0  Male   79750
3      Prof          B         45.0          39.0  Male  115000
4      Prof          B         40.0          41.0  Male  141500

In [9]:
#g = sns.FacetGrid(df, col = 'origin')
#g = (g.map(plt.scatter, "...", "...").add_legend())